/* automatically generated by rust-bindgen 0.72.1 */

#![allow(non_camel_case_types, non_snake_case, non_upper_case_globals)]

pub const NV_VERSION: u32 = 0;
pub const NV_ENCODE_NATIVE: u32 = 0;
pub const NV_ENCODE_XDR: u32 = 1;
pub const NV_UNIQUE_NAME: u32 = 1;
pub const NV_UNIQUE_NAME_TYPE: u32 = 2;
pub const NV_FLAG_NOENTOK: u32 = 1;
pub type longlong_t = ::std::os::raw::c_longlong;
pub type uchar_t = ::std::os::raw::c_uchar;
pub type uint_t = ::std::os::raw::c_uint;
pub const boolean_t_B_FALSE: boolean_t = 0;
pub const boolean_t_B_TRUE: boolean_t = 1;
pub const boolean_t__B_FALSE: boolean_t = 0;
pub const boolean_t__B_TRUE: boolean_t = 1;
pub type boolean_t = ::std::os::raw::c_uint;
pub type hrtime_t = longlong_t;
pub type __va_list = __builtin_va_list;
pub const data_type_t_DATA_TYPE_DONTCARE: data_type_t = -1;
pub const data_type_t_DATA_TYPE_UNKNOWN: data_type_t = 0;
pub const data_type_t_DATA_TYPE_BOOLEAN: data_type_t = 1;
pub const data_type_t_DATA_TYPE_BYTE: data_type_t = 2;
pub const data_type_t_DATA_TYPE_INT16: data_type_t = 3;
pub const data_type_t_DATA_TYPE_UINT16: data_type_t = 4;
pub const data_type_t_DATA_TYPE_INT32: data_type_t = 5;
pub const data_type_t_DATA_TYPE_UINT32: data_type_t = 6;
pub const data_type_t_DATA_TYPE_INT64: data_type_t = 7;
pub const data_type_t_DATA_TYPE_UINT64: data_type_t = 8;
pub const data_type_t_DATA_TYPE_STRING: data_type_t = 9;
pub const data_type_t_DATA_TYPE_BYTE_ARRAY: data_type_t = 10;
pub const data_type_t_DATA_TYPE_INT16_ARRAY: data_type_t = 11;
pub const data_type_t_DATA_TYPE_UINT16_ARRAY: data_type_t = 12;
pub const data_type_t_DATA_TYPE_INT32_ARRAY: data_type_t = 13;
pub const data_type_t_DATA_TYPE_UINT32_ARRAY: data_type_t = 14;
pub const data_type_t_DATA_TYPE_INT64_ARRAY: data_type_t = 15;
pub const data_type_t_DATA_TYPE_UINT64_ARRAY: data_type_t = 16;
pub const data_type_t_DATA_TYPE_STRING_ARRAY: data_type_t = 17;
pub const data_type_t_DATA_TYPE_HRTIME: data_type_t = 18;
pub const data_type_t_DATA_TYPE_NVLIST: data_type_t = 19;
pub const data_type_t_DATA_TYPE_NVLIST_ARRAY: data_type_t = 20;
pub const data_type_t_DATA_TYPE_BOOLEAN_VALUE: data_type_t = 21;
pub const data_type_t_DATA_TYPE_INT8: data_type_t = 22;
pub const data_type_t_DATA_TYPE_UINT8: data_type_t = 23;
pub const data_type_t_DATA_TYPE_BOOLEAN_ARRAY: data_type_t = 24;
pub const data_type_t_DATA_TYPE_INT8_ARRAY: data_type_t = 25;
pub const data_type_t_DATA_TYPE_UINT8_ARRAY: data_type_t = 26;
pub const data_type_t_DATA_TYPE_DOUBLE: data_type_t = 27;
pub type data_type_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvpair {
    pub nvp_size: i32,
    pub nvp_name_sz: i16,
    pub nvp_reserve: i16,
    pub nvp_value_elem: i32,
    pub nvp_type: data_type_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nvpair"][::std::mem::size_of::<nvpair>() - 16usize];
    ["Alignment of nvpair"][::std::mem::align_of::<nvpair>() - 4usize];
    ["Offset of field: nvpair::nvp_size"][::std::mem::offset_of!(nvpair, nvp_size) - 0usize];
    ["Offset of field: nvpair::nvp_name_sz"][::std::mem::offset_of!(nvpair, nvp_name_sz) - 4usize];
    ["Offset of field: nvpair::nvp_reserve"][::std::mem::offset_of!(nvpair, nvp_reserve) - 6usize];
    ["Offset of field: nvpair::nvp_value_elem"]
        [::std::mem::offset_of!(nvpair, nvp_value_elem) - 8usize];
    ["Offset of field: nvpair::nvp_type"][::std::mem::offset_of!(nvpair, nvp_type) - 12usize];
};
pub type nvpair_t = nvpair;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvlist {
    pub nvl_version: i32,
    pub nvl_nvflag: u32,
    pub nvl_priv: u64,
    pub nvl_flag: u32,
    pub nvl_pad: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nvlist"][::std::mem::size_of::<nvlist>() - 24usize];
    ["Alignment of nvlist"][::std::mem::align_of::<nvlist>() - 8usize];
    ["Offset of field: nvlist::nvl_version"][::std::mem::offset_of!(nvlist, nvl_version) - 0usize];
    ["Offset of field: nvlist::nvl_nvflag"][::std::mem::offset_of!(nvlist, nvl_nvflag) - 4usize];
    ["Offset of field: nvlist::nvl_priv"][::std::mem::offset_of!(nvlist, nvl_priv) - 8usize];
    ["Offset of field: nvlist::nvl_flag"][::std::mem::offset_of!(nvlist, nvl_flag) - 16usize];
    ["Offset of field: nvlist::nvl_pad"][::std::mem::offset_of!(nvlist, nvl_pad) - 20usize];
};
pub type nvlist_t = nvlist;
pub type nv_alloc_ops_t = nv_alloc_ops;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nv_alloc {
    pub nva_ops: *const nv_alloc_ops_t,
    pub nva_arg: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nv_alloc"][::std::mem::size_of::<nv_alloc>() - 16usize];
    ["Alignment of nv_alloc"][::std::mem::align_of::<nv_alloc>() - 8usize];
    ["Offset of field: nv_alloc::nva_ops"][::std::mem::offset_of!(nv_alloc, nva_ops) - 0usize];
    ["Offset of field: nv_alloc::nva_arg"][::std::mem::offset_of!(nv_alloc, nva_arg) - 8usize];
};
pub type nv_alloc_t = nv_alloc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nv_alloc_ops {
    pub nv_ao_init: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut nv_alloc_t,
            arg2: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int,
    >,
    pub nv_ao_fini: ::std::option::Option<unsafe extern "C" fn(arg1: *mut nv_alloc_t)>,
    pub nv_ao_alloc: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut nv_alloc_t, arg2: usize) -> *mut ::std::os::raw::c_void,
    >,
    pub nv_ao_free: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut nv_alloc_t, arg2: *mut ::std::os::raw::c_void, arg3: usize),
    >,
    pub nv_ao_reset: ::std::option::Option<unsafe extern "C" fn(arg1: *mut nv_alloc_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nv_alloc_ops"][::std::mem::size_of::<nv_alloc_ops>() - 40usize];
    ["Alignment of nv_alloc_ops"][::std::mem::align_of::<nv_alloc_ops>() - 8usize];
    ["Offset of field: nv_alloc_ops::nv_ao_init"]
        [::std::mem::offset_of!(nv_alloc_ops, nv_ao_init) - 0usize];
    ["Offset of field: nv_alloc_ops::nv_ao_fini"]
        [::std::mem::offset_of!(nv_alloc_ops, nv_ao_fini) - 8usize];
    ["Offset of field: nv_alloc_ops::nv_ao_alloc"]
        [::std::mem::offset_of!(nv_alloc_ops, nv_ao_alloc) - 16usize];
    ["Offset of field: nv_alloc_ops::nv_ao_free"]
        [::std::mem::offset_of!(nv_alloc_ops, nv_ao_free) - 24usize];
    ["Offset of field: nv_alloc_ops::nv_ao_reset"]
        [::std::mem::offset_of!(nv_alloc_ops, nv_ao_reset) - 32usize];
};
unsafe extern "C" {
    pub fn nvlist_alloc(
        arg1: *mut *mut nvlist_t,
        arg2: uint_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_free(arg1: *mut nvlist_t);
}
unsafe extern "C" {
    pub fn nvlist_size(
        arg1: *mut nvlist_t,
        arg2: *mut usize,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_pack(
        arg1: *mut nvlist_t,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: *mut usize,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_unpack(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *mut *mut nvlist_t,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_dup(
        arg1: *mut nvlist_t,
        arg2: *mut *mut nvlist_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_merge(
        arg1: *mut nvlist_t,
        arg2: *mut nvlist_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_nvflag(arg1: *mut nvlist_t) -> uint_t;
}
unsafe extern "C" {
    pub fn nvlist_xalloc(
        arg1: *mut *mut nvlist_t,
        arg2: uint_t,
        arg3: *mut nv_alloc_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_xpack(
        arg1: *mut nvlist_t,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: *mut usize,
        arg4: ::std::os::raw::c_int,
        arg5: *mut nv_alloc_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_xunpack(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *mut *mut nvlist_t,
        arg4: *mut nv_alloc_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_xdup(
        arg1: *mut nvlist_t,
        arg2: *mut *mut nvlist_t,
        arg3: *mut nv_alloc_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_nv_alloc(arg1: *mut nvlist_t) -> *mut nv_alloc_t;
}
unsafe extern "C" {
    pub fn nvlist_add_nvpair(arg1: *mut nvlist_t, arg2: *mut nvpair_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_boolean(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_boolean_value(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: boolean_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_byte(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: uchar_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_int8(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: i8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_uint8(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_int16(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: i16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_uint16(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: u16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_int32(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_uint32(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_int64(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_uint64(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_string(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_nvlist(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut nvlist_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_boolean_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut boolean_t,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_byte_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut uchar_t,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_int8_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i8,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_uint8_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u8,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_int16_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i16,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_uint16_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u16,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_int32_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i32,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_uint32_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u32,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_int64_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i64,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_uint64_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u64,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_string_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const *mut ::std::os::raw::c_char,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_nvlist_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut nvlist_t,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_hrtime(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: hrtime_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_double(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_remove(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: data_type_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_remove_all(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_remove_nvpair(arg1: *mut nvlist_t, arg2: *mut nvpair_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_boolean(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_boolean_value(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut boolean_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_byte(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut uchar_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_int8(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_uint8(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_int16(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_uint16(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_int32(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_uint32(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_int64(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_uint64(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_string(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_nvlist(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut nvlist_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_boolean_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut boolean_t,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_byte_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut uchar_t,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_int8_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut i8,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_uint8_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut u8,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_int16_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut i16,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_uint16_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut u16,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_int32_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut i32,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_uint32_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut u32,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_int64_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut i64,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_uint64_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut u64,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_string_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut *mut ::std::os::raw::c_char,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_nvlist_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut *mut nvlist_t,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_hrtime(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut hrtime_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_pairs(
        arg1: *mut nvlist_t,
        arg2: ::std::os::raw::c_int,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_double(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_nvpair(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut nvpair_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_nvpair_embedded_index(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut nvpair_t,
        arg4: *mut ::std::os::raw::c_int,
        arg5: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_exists(arg1: *mut nvlist_t, arg2: *const ::std::os::raw::c_char) -> boolean_t;
}
unsafe extern "C" {
    pub fn nvlist_empty(arg1: *mut nvlist_t) -> boolean_t;
}
unsafe extern "C" {
    pub fn nvlist_next_nvpair(arg1: *mut nvlist_t, arg2: *mut nvpair_t) -> *mut nvpair_t;
}
unsafe extern "C" {
    pub fn nvlist_prev_nvpair(arg1: *mut nvlist_t, arg2: *mut nvpair_t) -> *mut nvpair_t;
}
unsafe extern "C" {
    pub fn nvpair_name(arg1: *mut nvpair_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn nvpair_type(arg1: *mut nvpair_t) -> data_type_t;
}
unsafe extern "C" {
    pub fn nvpair_type_is_array(arg1: *mut nvpair_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_boolean_value(
        arg1: *mut nvpair_t,
        arg2: *mut boolean_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_byte(arg1: *mut nvpair_t, arg2: *mut uchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_int8(arg1: *mut nvpair_t, arg2: *mut i8) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_uint8(arg1: *mut nvpair_t, arg2: *mut u8) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_int16(arg1: *mut nvpair_t, arg2: *mut i16) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_uint16(arg1: *mut nvpair_t, arg2: *mut u16) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_int32(arg1: *mut nvpair_t, arg2: *mut i32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_uint32(arg1: *mut nvpair_t, arg2: *mut u32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_int64(arg1: *mut nvpair_t, arg2: *mut i64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_uint64(arg1: *mut nvpair_t, arg2: *mut u64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_string(
        arg1: *mut nvpair_t,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_nvlist(
        arg1: *mut nvpair_t,
        arg2: *mut *mut nvlist_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_boolean_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut boolean_t,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_byte_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut uchar_t,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_int8_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut i8,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_uint8_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut u8,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_int16_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut i16,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_uint16_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut u16,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_int32_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut i32,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_uint32_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut u32,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_int64_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut i64,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_uint64_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut u64,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_string_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut *mut ::std::os::raw::c_char,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_nvlist_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut *mut nvlist_t,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_hrtime(arg1: *mut nvpair_t, arg2: *mut hrtime_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_double(arg1: *mut nvpair_t, arg2: *mut f64) -> ::std::os::raw::c_int;
}
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::std::os::raw::c_uint,
    pub fp_offset: ::std::os::raw::c_uint,
    pub overflow_arg_area: *mut ::std::os::raw::c_void,
    pub reg_save_area: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __va_list_tag"][::std::mem::size_of::<__va_list_tag>() - 24usize];
    ["Alignment of __va_list_tag"][::std::mem::align_of::<__va_list_tag>() - 8usize];
    ["Offset of field: __va_list_tag::gp_offset"]
        [::std::mem::offset_of!(__va_list_tag, gp_offset) - 0usize];
    ["Offset of field: __va_list_tag::fp_offset"]
        [::std::mem::offset_of!(__va_list_tag, fp_offset) - 4usize];
    ["Offset of field: __va_list_tag::overflow_arg_area"]
        [::std::mem::offset_of!(__va_list_tag, overflow_arg_area) - 8usize];
    ["Offset of field: __va_list_tag::reg_save_area"]
        [::std::mem::offset_of!(__va_list_tag, reg_save_area) - 16usize];
};
